--- ****  Workshop Basic Query 1 **** ---

--1. แสดงข้อมูลทั้งหมดของพนักงานทุกรายการ


--2. แสดงข้อมูลทั้งหมดของสินค้าทุกรายการ


--3. แสดงข้อมูลใบสั่งซื้อทุกรายการ


--4. แสดงข้อมูลทั้งหมดของลูกค้าทุกรายการ


--5. แสดงข้อมูลรหัสสินค้า ชื่อสินค้า ราคาต่อหน่วย จำนวนคงเหลือ ของสินค้าทุกรายการ


--6. แสดงข้อมูลรหัสลูกค้า ชื่อบริษัทลูกค้า ชื่อผู้ติดต่อ ชื่อประเทศของลูกค้าทั้งหมด


--7. แสดงข้อมูลรหัสพนักงาน ชื่อ นามสกุล  ตำแหน่งงานของพนักงานทั้งหมด


--8. แสดงข้อมูลลูกค้าที่อยู่ในประเทศสหรัฐอเมริกา


--9. แสดงข้อมูลสินค้าที่มีราคาต่อหน่วยไม่เกิน $50


--10. แสดงข้อมูลสินค้าที่จัดจำหน่วยโดยบริษัทรหัส 1 และเป็นประเภทสินค้า รหัส 1


--11. แสดงข้อมูลสินค้าที่มีราคาต่อหน่วยอยู่ในช่วง $10-$30



--12. จงแสดงใบสั่งซื้อที่มีการสั่งซื้อในช่วงวันที่ 1 มค. 1997 - 31 สค. 1997


--13. แสดงข้อมูลรหัสลูกค้า ชื่อบริษัท ชื่อเมือง ชื่อประเทศ ของลูกค้าที่อยู่ในประเทเบลเยี่ยม อิตาลี โปร์แลนด์


--14. จงแสดงข้อมูลใบสั่งซื้อที่สั่งซื้อใน ปี 1997 และจัดส่งไปยังประเทศสหรัฐอเมริกา สหราชอาณาจักร สวิสเซอร์แลนด์


--15. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทขึ้นต้นด้วยอักษร A

--16. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทมีคำว่า the ภายในชื่อ


--17. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทขึ้นต้นด้วยอักษร F ลงท้าย n


--18. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทขึ้นต้นด้วยอักษร A หรือ F หรือ S ลงท้ายด้วย n


--19. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทยาว 20 ตัวอักษร 

--20. แสดงรหัสลูกค้า ชื่อบริษัท ชื่อประเทศ เฉพาะลูกค้าที่มีชื่อบริษัทไม่ได้ขึ้นต้นชื่อด้วยอักษร T หรือ W หรือ D






