--- ****  Workshop Basic Query 2 **** ---
--1. แสดงข้อมูลสินค้า 10 รายการแรก

--2. แสดงรหัสพนักงาน ชื่อและนามสกุลต่อกัน อายุ ของพนักงานแต่ละคน


/*3. แสดงข้อมูลรหัสสินค้า ชื่อสินค้า ราคาต่อหน่วย จำนวนคงเหลือ รหัสประเภทสินค้า
จัดเรียงข้อมูลตามรหัสประเภทสินค้า จากน้อยไปหามาก และจำนวนคงเหลือจากมากไปหาน้อย */


--4. แสดงจำนวนรายการสินค้าที่จัดอยู่ในประเภทสินค้ารหัส 1


--5. แสดงจำนวนลูกค้าที่อยู่ในประเทศสหรัฐอเมริกา


--6. แสดงจำนวนใบสั่งซื้อที่จัดส่งไปยังประเทศฝรั่งเศส ในปี 1997


--7. แสดงราคาต่อหน่วยของสินค้าที่แพงสุด และถูกที่สุด


--8. จงแสดงอายุของพนักงานที่มากสุดและอายุน้อยสุด



--9. แสดงรหัสสินค้า ราคาต่อหน่วย จำนวนที่ซื้อ ราคารวม ของรายการสั่งซื้อที่อยู่ในใบสั่งซื้อหมายเลข10248


--10. แสดงยอดสั่งซื้อรวมของใบสั่งซื้อหมายเลข 10248


--11. แสดงอายุเฉลี่ยของพนักงาน


--******** GROUP BY ********

--12. แสดงรหัสประเภทสินค้าและจำนวนรายการสินค้าในแต่ละประเภท


--13. แสดงรหัสประเภทสินค้าและจำนวนรายการสินค้าในแต่ละประเภท เฉพาะประเภทสินค้าที่มีรายการสินค้สอยู่ในประเภทนั้น 10 รายการขึ้นไป


--14. แสดงชื่อประเทศและจำนวนลูกค้าที่อยู่ในแต่ละประเทศ เฉพาะประเทศที่มีลูกค้าไม่ถึง 5 ราย


/*15. แสดงรหัสใบสั่งซื้อและยอดสั่งซื้อรวมในแต่ละใบสั่งซื้อ เฉพาะใบสั่งซื้อที่มียอดสั่งซื้อรวมเกิน $10000
จัดเรียงข้อมูลตามยอดสั่งซื้อรวมจากมากไปหาน้อย */
